## 판다스 (Pandas)

- 핵심객체는 DataFrame이다
- 데이타프레임은 2차원 데이터 구조체로 넘파이보다 편리하게 데이타 핸들링한다.
- R 언어의 데이타 프레임과 비슷하고 많이 사용된다


#### DataFrame 에서 데이타 필터링 ( 추출하기 )

0. 맨처음에는

    + df[2] : 2행의 데이타 추출
    + df['A'] : A열(컬럼) 데이타 추출
    
    + df[n:m] : n번째부터 m-1번째까지의 행 추출
        
    ` 행과 열을 섞어서 추출함.
    ` 판다스를 만든 사람이 쓴 책의 번역서를 보면 이 부분을 후회한다고 나옴
      

1. 열(컬럼) 추출

    + df.컬럼명
    + df['컬럼명']
       
    
2. 행 추출

    + df.loc[] : 인덱스(순서)와 명칭으로 추출
    + df.iloc[] : 인덱스(순서)로 추출
    + df.ix[] : 명칭 기반 인덱싱과 위치 기반 인덱싱 모두 사용 (* 그러나 곧 사라질 예정 )

    [참고] 
    
    - 위 3 연산자는 노련한 개발자들도 혼동하기에, 일반적으로 하나만 선택해서 사용하는 것을 권장한단다
    - 넘파이와 유사한 부분으로 더우 혼동하기 쉽다
    - 판다스의 DataFrame와 Series에서도 다른이 있어서 주의해야 한다
    
    
3. 행과 열에서 추출
    
    + df.loc[2, 3] : 2 행의 3열 데이타
    + df.loc[1:3, 2:4] : 1부터 3행전까지의 행에서 2부터 4전까지의 열의 데이타

한번 쭉 훑어보기

In [2]:
import pandas as pd

# 데이타 프레임 자료 생성
mydata = {
          'name':['홍길동','박길동','김길동'], 
          'age':[22,33,44], 
          'dept':['컴공','국어','산업']
         }
df = pd.DataFrame(mydata)
df                 

# 인덱스 지정도 가능 
df3=pd.DataFrame(mydata, index=['일','이','삼'])
df3

  name  age dept
일  홍길동   22   컴공
이  박길동   33   국어
삼  김길동   44   산업

In [2]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [3]:
df.columns

Index(['name', 'age', 'dept'], dtype='object')

In [4]:
df.values

array([['홍길동', 22, '컴공'],
       ['박길동', 33, '국어'],
       ['김길동', 44, '산업']], dtype=object)

### 컬럼 추가, 행 추가

In [5]:
# 컬럼 추가
df['gender'] = ['여자','여자','남자']
df

  name  age dept gender
0  홍길동   22   컴공     여자
1  박길동   33   국어     여자
2  김길동   44   산업     남자

In [6]:
# 행 추가 (인덱스 3에 추가)
df.loc[3] = ['이길동',55, '기계', '남자']
df

  name  age dept gender
0  홍길동   22   컴공     여자
1  박길동   33   국어     여자
2  김길동   44   산업     남자
3  이길동   55   기계     남자

In [7]:
# 행 추가 ( 인덱스 5에 추가) : iloc로 하면 에러 발생하는데
df.loc[5] = ['장길동',55, '기계', '남자']
df

  name  age dept gender
0  홍길동   22   컴공     여자
1  박길동   33   국어     여자
2  김길동   44   산업     남자
3  이길동   55   기계     남자
5  장길동   55   기계     남자

### 변경

In [8]:
# 인덱스순서를 변경하려면 -> 인덱스는 우선 DataFrame이 있는 상태에서 변경해야 한다
df = df.reindex(index=[0,2,5,3,1])
df

  name  age dept gender
0  홍길동   22   컴공     여자
2  김길동   44   산업     남자
5  장길동   55   기계     남자
3  이길동   55   기계     남자
1  박길동   33   국어     여자

In [9]:
# 컬럼연산
df['age+10'] = df['age'] + 10
df

  name  age dept gender  age+10
0  홍길동   22   컴공     여자      32
2  김길동   44   산업     남자      54
5  장길동   55   기계     남자      65
3  이길동   55   기계     남자      65
1  박길동   33   국어     여자      43

In [10]:
#  인덱스 5에 'dept'열의 값을 '인문'으로 변경
df.loc[5,'dept'] = '인문'
df

# 아래처럼 하면??? 새로운 컬럼이 되는거야??
df[5,'dept']='수학'
df

  name  age dept gender  age+10 (5, dept)
0  홍길동   22   컴공     여자      32        수학
2  김길동   44   산업     남자      54        수학
5  장길동   55   인문     남자      65        수학
3  이길동   55   기계     남자      65        수학
1  박길동   33   국어     여자      43        수학

###  컬럼 속성 추출

In [11]:
# 컬럼 속성 추출
df['dept']
df.dept

df['name']
df.name

0    홍길동
2    김길동
5    장길동
3    이길동
1    박길동
Name: name, dtype: object

In [12]:
# 특정 컬럼의 특정행 -> 즉 특정셀 ( 2번 인덱스의 dept 컬럼값은? )
df.dept[2]
df['dept'][2]

'산업'

In [13]:
# 30세 이상의 레코드 겁색
# df['age']>30
df[df['age']>30]

  name  age dept gender  age+10 (5, dept)
2  김길동   44   산업     남자      54        수학
5  장길동   55   인문     남자      65        수학
3  이길동   55   기계     남자      65        수학
1  박길동   33   국어     여자      43        수학

In [15]:
# 인덱스 1의 name 값을 '맹길동'로 변경하려면?
print(df)

# df['name'][1] = '박가'
# print(df)

# df.name[1] ='맹가'
# print(df)

# Warning - df['name']이라고 추출했을 때 원본이 아닌 복사인가??

# df[1,'name'] ='맹길동'  # 아님 (2, name) 컬럼이 생성됨
df.loc[1,'name'] = '맹길동'
df

  name  age dept (2, name)
0  홍길동   22   컴공       맹길동
1  박길동   33   국어       맹길동
2  맹길동   44   산업       맹길동

  name  age dept (2, name)
0  홍길동   22   컴공       맹길동
1  맹길동   33   국어       맹길동
2  맹길동   44   산업       맹길동

## 데이타 필터링

- 넘파이와 유사한 부분으로 더우 혼동하기 쉽다

- 판다스의 DataFrame와 Series에서도 다른 부분이 있어서 주의해야 한다


1. loc[] : 인덱스와 명칭으로 추출

2. iloc[] : 인덱스로 추출

3. ix[] : 명치 기반 인덱싱과 위치 기반 인덱싱 모두 사용 (*  그러나 곧 사라질 예정 )


위 3 연산자는 노련한 개발자들도 혼동하기에,
일반적으로 하나만 선택해서 사용하는 것을 권장한단다

In [3]:
# 인덱스 1의 데이타 추출 -> loc와 iloc의 결과가 다름(정리필요)
print(df.loc[1])  #  인덱스 1행의 데이타 추출
print('-'*50)
print(df.iloc[1]) # 인덱스 1번째(0번째부터) 데이타 추출

# print(df)

# df.loc[1,2] #  -> 에러
print(df.iloc[1,2])
# print(df.loc[1,'dept'])

name    박길동
age      33
dept     국어
Name: 1, dtype: object
--------------------------------------------------
name    박길동
age      33
dept     국어
Name: 1, dtype: object
국어
국어

In [7]:
# 명칭기반 인덱스 : 문자열이 인덱스인 경우

df3

# df3.loc['일']
# df3.iloc['일'] -> 에러

  name  age dept
일  홍길동   22   컴공
삼  김길동   44   산업

In [9]:
# 여러 행 추출 - 일과 삼 데이타 추출
df3.loc[['일','삼']]
# 여러 열 추출 - name과 age 데이타 추출
df3[['name','age']]

  name  age
일  홍길동   22
이  박길동   33
삼  김길동   44

In [19]:
# 특정 컬럼으로 인덱스를 지정
df.set_index('name')
df.index   # 변동이 없음
df         # 변화가 없음 ( 원본 적용이 안됨 )

# 원본 데이타프레임에 적용해야 한다
# 다시 실행하려면 df 데이타프레임을 다시 생성 후
df2 = df.set_index('name')
df2.index
df2.loc['홍길동']
# df2.iloc['홍길동'] -> 에러

# df.set_index('name', inplace=True) # inplcace=True 원본적용
# df.index
# df.loc['홍길동']

  name  age dept (2, name)
0  홍길동   22   컴공       맹길동
1  맹길동   33   국어       맹길동
2  맹길동   44   산업       맹길동

### 정렬과 T

+ sort_value() 정리

In [18]:
# 나이를 오름차순으로
# df.sort_index(ascending=0)   # 인덱스 정렬 기본값이 ascending=1
df.sort_values('age', ascending=0) # 값으로 정렬
df.sort_values('age', ascending=False) # 권장
df   # 원본은 안 바뀐다

df_sorted = df.sort_values('age', ascending=False)
df_sorted        # 권장

df.sort_values('age', ascending=False, inplace=True)
df               # 전문가들은 원본이 변경하지 않는 것을 권장

  name  age dept gender  age+10 (5, dept)
5  장길동   55   인문     남자      65        수학
3  이길동   55   기계     남자      65        수학
2  김길동   44   산업     남자      54        수학
1   맹가   33   국어     여자      43        수학
0  홍길동   22   컴공     여자      32        수학

In [19]:
df.T

             5    3    2   1    0
name       장길동  이길동  김길동  맹가  홍길동
age         55   55   44  33   22
dept        인문   기계   산업  국어   컴공
gender      남자   남자   남자  여자   여자
age+10      65   65   54  43   32
(5, dept)   수학   수학   수학  수학   수학

### 정보확인

+ info()
+ describe()

In [20]:
# 총 데이터 건수와 데이타 타입등 정보 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 5 to 0
Data columns (total 6 columns):
name         5 non-null object
age          5 non-null int64
dept         5 non-null object
gender       5 non-null object
age+10       5 non-null int64
(5, dept)    5 non-null object
dtypes: int64(2), object(4)
memory usage: 440.0+ bytes

In [21]:
# 기본통계량 구하기 ( 총개수, 평균, 표준편차, 최소값, 4분위수 등)
df.describe()

# 숫자형에 한에 기본통계량이 확인

             age     age+10
count   5.000000   5.000000
mean   41.800000  51.800000
std    14.342245  14.342245
min    22.000000  32.000000
25%    33.000000  43.000000
50%    44.000000  54.000000
75%    55.000000  65.000000
max    55.000000  65.000000